function pool(input){
    const peopleQuantity = Number(input[0]);
    const poolTax = Number(input[1]);
    const sunbedPrice = Number(input[2]);
    const umbrelaPrice = Number(input[3]);
    const sunbedNeeded = Math.ceil(peopleQuantity * 0.75);
    const umbrelaNeeded = Math.ceil(peopleQuantity / 2);
    const totalPrice = (umbrelaNeeded * umbrelaPrice) + (sunbedNeeded * sunbedPrice) + (peopleQuantity * poolTax);
        console.log(`${totalPrice.toFixed(2)} lv.`);
}
pool(["50",
"6",
"8",
"4"])


// Преподавателският екип на СофтУни организира работен ден на басейн по случай настъпването на лятото.
// Вашата задача е да напишете програма, която да изчислява каква сума трябва да се заплати. За всеки един
// човек от екипа трябва да се заплати такса вход. Трябва да имате предвид, че един чадър стига за двама
// души. Знае се, че само 75% от екипа искат шезлонги. При изчислението на броя на чадърите и шезлонгите,
// техният брой да се закръгли до по-голямото цяло число.
// Вход
// От конзолата се четат 4 числа:
// • Първи ред – брой на хората. Цяло число в интервала [1…100]
// • Втори ред – такса вход. Реално число в интервала [0.00…50.00]
// • Трети ред – цена един за шезлонг. Реално число в интервала [0.00…50.00]
// • Четвърти ред – цена за един чадър. Реално число в интервала [0.00...50.00]
// Изход
// "{сумата за покриване на разходите} lv."
// Резултатът да се форматира до втората цифра след десетичния знак.