function sumAndProduct(input) {
    let n = Number(input[0]);
    let nBeString = input[0]
    let n3 = Number(nBeString.charAt(2));
    count = 0;
    let isFound = false;

    for (let a = 1; a <= 9; a++) {
        for (let b = 9; b > a; b--) {
            for (let c = 1; c <= 9; c++) {
                for (let d = 9; d > c; d--) {
                    if (a + b + c + d === a * b * c * d && n3 === 5) {
                        count++
                        if (count <= 1) {
                            console.log(`${a}${b}${c}${d}`);
                            isFound = true;
                        }
                    } else if (Math.trunc((a * b * c * d) / (a + b + c + d)) == 3 && n % 3 === 0) {
                        count++
                        if (count <= 1) {
                            console.log(`${d}${c}${b}${a}`);
                            isFound = true
                        }

                    }
                }
            }
        }
    } if (!isFound) {

        console.log("Nothing found");

    }
}
sumAndProduct(["123"])
sumAndProduct(["145"])
sumAndProduct(["214"])


// Да се напише програма, която проверява сумата и произведението на всички числа, които са комбинация от четирите цифри a, b, c и d.
// В проверката участва и още едно число - n, което се чете от конзолата.
// За всяка комбинация четирите цифри a, b, c и d се променят по следния начин:
// a се мени от 1 до 9
// b се мени от 9 до а
// c се мени от 0 до 9
// d се мени от 9 до c
// Ако сумата (a + b + c + d) е равна на произведението (a * b * c * d) и едновременно с това n завършва на 5,
//  трябва да се принтира числото abcd.
// Ако разделим произведението (a * b * c * d) на сумата (a + b + c + d) и получим 3 (целочислено),
//  и едновременно с това n се дели на 3 без остатък, трябва да се принтира числото dcba.
// Програмата трябва да принтира на конзолата само първата валидна комбинация.
// Ако не се намери такова число abcd или dcba, трябва да се принтира "Nothing found".
// Вход:
// От конзолата се прочита 1 ред:
// n - цяло число в интервала [100…1000]
// Изход:
// На конзолата се отпечатва 1 ред:
// Ако се намери валидна комбинация:
// "{number}", където {number} е комбинацията abcd или комбинацията dcba
// Ако НЕ се намери такава комбинация:
// "Nothing found"