function challengeTheWedding(input){
    let maleClients = Number(input[0]);
    let femaleClients = Number(input[1]);
    let tablesCount = Number(input[2]);
    let maleCombi = 0;
    let femaleCombi = 0;
    let count = 0;
    let printLine = 0

        for(let i = 1; i <= maleClients; i++){    
            maleCombi = i;        
            for(let j = 1; j <= femaleClients; j++){
                femaleCombi = j;
                if(i === 1 && j === 1){
                    printLine = `(${maleCombi} <-> ${femaleCombi}) `;
                    count++;
                } else {
                count++;
                printLine +=`(${maleCombi} <-> ${femaleCombi}) `;
                }
                if(count >= tablesCount){                    
                    break;
                }
            }
        } console.log(printLine)
}
challengeTheWedding(["5","8","40"])




// Провокирани от сватбата си, Михаела и Иван решават да предоставят нова услуга на клиенти на ресторанта си,
//  а именно вечеря за запознанства - "Предизвикай Сватбата".
//   Напишете програма, която отпечатва всички възможни срещи на клиентите на ресторанта.
//    При настаняване всеки мъж и всяка жена получават талончета с поредни номера стартирайки от 1.
//     Ако бъдат заети всички маси, програмата трябва да приключи. Всяка маса има две места.
// Вход
// От конзолата се четат точно 3 числа, всяко на отделен ред:
// Броя клиенти мъже - цяло число в интервала [1...100]
// Броя клиенти жени - цяло число в интервала [1...100]
// Максималният брой маси - цяло число в интервала [1...100]
// Изход
// На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
// ({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...