function plateNumber(input) {
    let numOne = Number(input[0]);
    let numTwo = Number(input[1]);
    let specialNum = '';
    if (numOne > numTwo) {
        for (let i = numTwo; i <= numOne; i++) {
            for (let j = numTwo; j <= numOne; j++) {
                for (let k = numTwo; k <= numOne; k++) {
                    for (let l = numTwo; l <= numOne; l++) {
                        if (i > l && (j + k) % 2 === 0) {
                            if (i % 2 === 0 && l % 2 !== 0 || i % 2 !== 0 && l % 2 === 0) {
                                specialNum += `${i}${j}${k}${l} `
                            }
                        }
                    }
                }
            }
        }
    }
    else {
        for (let i = numOne; i <= numTwo; i++) {
            for (let j = numOne; j <= numTwo; j++) {
                for (let k = numOne; k <= numTwo; k++) {
                    for (let l = numOne; l <= numTwo; l++) {
                        if (i > l && (j + k) % 2 === 0) {
                            if (i % 2 === 0 && l % 2 !== 0 || i % 2 !== 0 && l % 2 === 0) {
                                specialNum += `${i}${j}${k}${l} `
                            }
                        }
                    }
                }
            }
        }
    }
    console.log(specialNum)
}
plateNumber(["5", "8"])

// Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР
//  реши да наеме точно вас за създаването на новата им система за генериране на специални автомобилни номера.
//   Всеки един специален автомобилен номер се състой от четири числа.
//    Условията, които разграничават специалните от обикновените номера са следните:
// Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна,  завършва на четна
// Първата цифра от номера е по-голяма от последната
// Сумата от втората и третата цифра трябва да е четно число
// Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
// Вход
// Първи ред - едноцифрено число - началото на интервала – цяло число в интервала [1…9]
// Втори ред - едноцифрено число - края на интервала – цяло число в интервала [1…9]
// Изход
// На конзолата трябва да се отпечатат всички специални номера, разделени с интервал.
