function vacation(input) {
  const budget = Number(input[0]);
  const season = input[1];

  let location = "";
  let place = "";
  let price = 0;

  switch (season) {
    case "Summer":
      if (budget <= 1000) {
        place = "Camp";
        location = "Alaska";
        price = budget * 0.65;
      } else if (budget > 1000 && budget <= 3000) {
        place = "Hut";
        location = "Alaska";
        price = budget * 0.8;
      } else if (budget > 3000) {
        place = "Hotel";
        location = "Alaska";
        price = budget * 0.9;
      }
      break;
    case "Winter":
      if (budget <= 1000) {
        place = "Camp";
        location = "Morocco";
        price = budget * 0.45;
      } else if (budget > 1000 && budget <= 3000) {
        place = "Hut";
        location = "Morocco";
        price = budget * 0.6;
      } else if (budget > 3000) {
        place = "Hotel";
        location = "Morocco";
        price = budget * 0.9;
      }
      break;
  }
  console.log(`${location} - ${place} - ${price.toFixed(2)}`);
}
vacation(["799.50", "Winter"]);

// Напишете програма, която спрямо даден бюджет и сезон да пресмята цената, локацията и мястото на настаняване за ваканция.
//  Сезоните са лято и зима – "Summer" и "Winter". Локациите са – "Alaska" и "Morocco". Възможните места за настаняване – "Hotel", "Hut" или "Camp".

// •	При бюджет по-малък или равен от 1000лв.:
// o	Настаняване в "Camp"
// o	Според сезона локацията ще е една от следните и ще струва определен процент от бюджета:
// 	Лято – Аляска – 65% от бюджета
// 	Зима – Мароко – 45% от бюджета

// •	При бюджет по-голям от 1000лв. и по-малък или равен от 3000лв.:
// o	Настаняване в "Hut"
// o	Според сезона локацията ще е една от следните и ще струва определен процент от бюджета:
// 	Лято – Аляска – 80% от бюджета
// 	Зима – Мароко – 60% от бюджета

// •	При бюджет по-голям от 3000лв.:
// o	Настаняване в "Hotel"
// o	Според сезона локацията ще е една от следните и ще струва 90% от бюджета:
// 	Лято – Аляска
// 	Зима – Мароко

// Вход
// Входът се чете от конзолата и се състои от два реда:
// •	Първи ред – Бюджет – реално число в интервала [10.00...10000.00]
// •	Втори ред –  Сезон – текст "Summer" или "Winter"

// Изход
// На конзолата трябва да се отпечатат един ред.
// "{локацията} – {мястото за настаняване} – {цената}"
// Цената трябва да е форматирана до вторият знак след десетичната запетая.
